{
    "settings": {
        "glyphicons" : true
    },
    "firstname": "Salman",
    "familyname": "Mushir",
    "linkedin_id": "SalmanMushir",
    "github_id": "slmnm",
    "bio_data": {
        "email": " salman315@gmail.com",
        "phone": " +91 7795676501",
        "website": " about.me/SalmanMushir",
        "stars": ["Android Developer", "Internet Marketing Specialist"],
	"summary": {
		"points":[
		"Worked on the Android platform for 2 years. Have full understanding of the Android SDK and the design patterns endorsed by the platform.",
		"Primarily programmed in Java. Have done fairly complex computation for mobile applications by making use of open source technologies and tools on the linux platform. Proficient with object oriented programming.",
		"Have taken up multiple roles in a startup that are fundamental in the life of a mobile project. To put it in English -> Market research, architecting requirements, prototyping and designing user experiences, developing software, testing for bugs, documenting code, writing manuals, and providing customer support.",
		"Have been experimenting heavily with HTML5, CSS, Javascript, Git (and Github). Loving it! A recent personal project that I built -> [aapkamp.in](http://aapkamp.in/) . Design and UX is always priority.",
		"Involved in voluntary work in Indian politics. Web admin for Aam Aadmi Party Mangalore unit. I make heavy use of technology (web and social media) to advocate the cause.",
		"Technology enthusiast. Highly driven and passionate about creating products for the web (and mobile). Also very passionate about the products I use.",
		"Love learning new things (not just of technology). Evangelist of Massive Open Online Courses. Have a few certificates -> [accredible.com/u/salmanmushir](https://learning.accredible.com/u/salmanmushir)"
		]
	},
        "skills": {
            "details": [
                {
                    "type": "Programming",
                    "items": [
			"Android SDK",
                        "Java",
                        "xml",
			"SQLite",
                        "Javascript",
                        "HTML5",
			"CSS"
                    ]
                },
                {
                    "type": "Tools",
                    "items": [
                        "Eclipse",
                        "Brackets",
                        "Git",
                        "Office software suite",
			"Linux",
			"Windows"
                    ]
                },
                {
                    "type": "Other",
                    "items": [
                        "Social Media",
                        "Blogging",
                        "Internet Marketing",
                        "Customer Support"
                    ]
                }
            ]
        },
        "education": {
	    "show_gpa": false,
            "schools": [
                {
                    "degree": "Bachelor of Engineering",
                    "major": "Telecommunications Engineering",
                    "institution": "Bangalore Institute of Technology",
                    "graduation_year": 2012,
                    "gpa": "3.55/4"
                }
            ]
        },
	"experience": {
            "items": [
                {
                    "title": "Android Developer",
                    "organisation": "Indea Engineering",
		            "location": "Mangalore, India",
                    "from": "Jul. 2012",
                    "to": "Dec. 2013",
                    "details": [
                        "Worked on different aspects of Mobile Application project. The apps are in business and productivity category, with features for Inventory management, Expense recording, Invoice reporting, etc.",
			"Did market research and crafted requirements for mobile projects.",
			"Responsible for designing the user interface using various custom layouts and widgets provided in the Android SDK (using XML and Java).",
			"Implemented features such as inventory tracking using Java programming language and SQLite for database",
			"Using Dropbox Core API, created a reusable module to import and export CSV data to user's Dropbox folder. Incorporated this module into 3 apps for cloud backup/restore feature.",
			"Wrote comprehensive documentation for our apps and processes within the company.",
			"Provided customer support via e-mail for users world wide."
                    ],
                    "technology_used": {
                        "tools": [
                            "myStock Inventory Manager",
                            "myBiz Mobile Business Manager",
                            "myBook Personal Organizer"
                        ]
                    }
                },
                {
                    "title": "Intern Software Developer",
                    "organisation": "GeniusPort",
                    "location": "Mangalore, India",
                    "from": "Aug. 2010",
                    "to": "Nov. 2010",
                    "details": [
                        "Created mocks for potential Android Apps to be built for clients.",
                        "Tested mobile applications on different screen dimensions and versions of Android using device emulators and actual devices.",
                        "Learnt about the tools involved and development environment for Android Programming."
                    ]
                }
            ]
        },
        "other_projects": {
            "items": [
                {
                    "headline": "[AAPkaMP.in | A campaigning tool for Aam Aadmi Party, India](http://aapkamp.in/)",
                    "points": [
                        "A website showcasing the exemplary nature of the MP candidates representing Aam Aadmi Party in the 28 constituencies in Karnataka.",
		    	"Includes a tumblr blog at [blog.aapkamp.in](http://blog.aapkamp.in/) documenting the journey of Aam Aadmi Party.",
			"Tech specs: Responsive website (mobile friendly) built using the CSS framework Bootstrap, and hosted as Github Pages. Code is open source on Github -> [slmnm/AAPkaMP](https://github.com/slmnm/AAPkaMP)",
			"Other features include share buttons using AddThis, donate widget from official sources with real time updates, analytics using google analytics."
                    ]
                }                
            ]
        },
        "grad_courses": [
            {
                "name": "Startup Engineering",
                "url": "https://learning.accredible.com/48530"
            },
            {
                "name": "Programming Mobile Applications for Android Handheld Systems",
                "url": "https://www.coursera.org/maestro/api/certificate/get_certificate?verify-code=9SGWDCC9U8"
            },
            {
                "name": "History and Future of (Mostly) Higher Education",
                "url": "https://learning.accredible.com/48531"
            },
            {
                "name": "Creativity, Innovation, and Change",
                "url": "https://learning.accredible.com/48573"
            }
         ],
        "research_experience": {
            "items": [
                {
                    "title":"Web Admin",
			        "organisation": "Aam Aadmi Party, Mangalore",
			        "from": "Mar. 2013",
			        "to": "Jun. 2013",
			        "points": [
			            "Responsible for making content updates (press releases, events, etc) to the Aam Aadmi Party Mangalore official website -> aapdk.com.",
			            "Involved in occasional ground level work and public meetings concerning the cause and interests supporting Aam Aadmi Party. Also part of the social media and strategy team.",
						"Have a personal project in this respect (see personal projects)."
	            ]
                }
            ]
        },
        "extra_curricular": {
            "items": [
                "I enjoy reading. Was among top 5% of the 10M readers on Pocket in 2013. Or so I was told :) [bit.ly/pocketAward](http://bit.ly/pocketAward)",
                "I enjoy writing. Have few blog posts scattered around the web."
            ]
        }
    }
}
